app/controllers/password_resets_controller.rb

 def create
   @user = User.find_by_email(params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "jane.rawls@me.com"], ["LIMIT", 1]]