app/controllers/reservations_controller.rb

INSERT INTO "reservations" ("passenger_id", "voyage_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["passenger_id", 2], ["voyage_id", 1], ["created_at", 2016-10-01 22:47:38 UTC], ["updated_at", 2016-10-01 22:47:38 UTC]]
---
    def create
      @reservation = Reservation.new
      @reservation.passenger_id = current_user.id
      @reservation.voyage_id = params[:voyage_id]

      if @reservation.save