app/controllers/voyages_controller.rb

SELECT "voyages".* FROM "voyages"
---
  def index
    if @user
      @voyages = @user.voyages
    else
      @voyages = Voyage.all

SELECT  "voyages".* FROM "voyages" WHERE "voyages"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
  def show
    @reservation = Reservation.new
    @voyage = Voyage.find(params[:id])

SELECT  "voyages".* FROM "voyages" WHERE "voyages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @voyage = Voyage.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "voyages".* FROM "voyages" WHERE "voyages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "voyages" SET "boat_image_url" = ?, "capacity" = ?, "updated_at" = ? WHERE "voyages"."id" = ?  [["boat_image_url", "http://images.boats.com/resize/1/70/86/5157086_20150721064416621_1_LARGE.jpg?w=600&h=600"], ["capacity", 0], ["updated_at", 2016-10-03 18:27:49 UTC], ["id", 4]]
---
  def update
    @user = User.find(current_user)
    @voyage = Voyage.find(params[:id])
    if @voyage.update(voyage_params)

INSERT INTO "voyages" ("title", "captain_id", "created_at", "updated_at", "location", "description", "vessel_type", "start_time", "end_time", "capacity") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @voyage = Voyage.new(voyage_params)
    @voyage.captain = current_user

      if @voyage.save